Thanks for this. I understand your concern about the `vendor_config` not showing immediately following import. The reason for this is that it is an input-only field provided by the user for creation and updates that is not returned on read responses of the MVE from the Megaport API. However, if the `vendor_config` is included in the plan following import, it will be incorporated into the state file on the next apply, as is shown in your logging: 

```# module.megaport_mve.megaport_mve.mve will be updated in-place
  ~ resource "megaport_mve" "mve" {
      ~ contract_start_date    = "Thursday, 18-Jul-24 17:05:04 CEST" -> (known after apply)
      ~ cost_centre            = null -> (known after apply)
      + last_updated           = (known after apply)
      ~ live_date              = "Thursday, 18-Jul-24 17:05:04 CEST" -> (known after apply)
      ~ provisioning_status    = "LIVE" -> (known after apply)
      ~ terminate_date         = null -> (known after apply)
      + vendor_config          = {
          + image_id     = 204449
          + product_size = "MEDIUM"
          + vendor       = "CISCO"
        }
        # (27 unchanged attributes hidden)
    }
```

In addition, because you are not changing the MVE image ID, vendor, or size of the MVE, the import will not affect the state or underlying configuration of the MVE resource.  While the `vendor_config` is not showing immediately after import, it's not changing the underlying configuration for the deployed MVE, it's still going to be a Medium Cisco MVE with the Image ID of 204449.  

If it does not show up in the statefile following the subsequent apply, please let us know. And please feel free to reach out if you have any additional questions or concerns! 